#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/thclpr/default/runs/run-riLmgTtLh6U6sR1m

Waiting for the plan to start...

Terraform v1.0.9
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.nsg_rules["allow_http"].azurerm_network_security_rule.nsr will be created
  + resource "azurerm_network_security_rule" "nsr" {
      + access                      = "Allow"
      + destination_address_prefix  = "*"
      + destination_port_ranges     = [
          + "80",
        ]
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "allow_http"
      + network_security_group_name = "nsg-default"
      + priority                    = 100
      + protocol                    = "tcp"
      + resource_group_name         = "vnet-default-rg"
      + source_address_prefixes     = [
          + "0.0.0.0/0",
        ]
      + source_port_range           = "*"
    }

  # module.rg_vnet.azurerm_resource_group.rg will be created
  + resource "azurerm_resource_group" "rg" {
      + id       = (known after apply)
      + location = "northeurope"
      + name     = "vnet-default-rg"
      + tags     = {
          + "module_version" = "local"
          + "source"         = "terraform"
          + "workspace"      = "default"
        }
    }

  # module.vnet.azurerm_network_security_group.nsg will be created
  + resource "azurerm_network_security_group" "nsg" {
      + id                  = (known after apply)
      + location            = "northeurope"
      + name                = "nsg-default"
      + resource_group_name = "vnet-default-rg"
      + security_rule       = (known after apply)
      + tags                = {
          + "module_version" = "local"
          + "source"         = "terraform"
          + "workspace"      = "default"
        }
    }

  # module.vnet.azurerm_subnet.subnet["nodes"] will be created
  + resource "azurerm_subnet" "subnet" {
      + address_prefix                                 = (known after apply)
      + address_prefixes                               = [
          + "10.5.0.0/26",
        ]
      + enforce_private_link_endpoint_network_policies = false
      + enforce_private_link_service_network_policies  = false
      + id                                             = (known after apply)
      + name                                           = "nodes"
      + resource_group_name                            = "vnet-default-rg"
      + virtual_network_name                           = "vnet-default"
    }

  # module.vnet.azurerm_subnet_network_security_group_association.nsga["nodes"] will be created
  + resource "azurerm_subnet_network_security_group_association" "nsga" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = (known after apply)
    }

  # module.vnet.azurerm_virtual_network.vnet will be created
  + resource "azurerm_virtual_network" "vnet" {
      + address_space         = [
          + "10.5.0.0/18",
        ]
      + dns_servers           = []
      + guid                  = (known after apply)
      + id                    = (known after apply)
      + location              = "northeurope"
      + name                  = "vnet-default"
      + resource_group_name   = "vnet-default-rg"
      + subnet                = (known after apply)
      + tags                  = {
          + "module_version" = "local"
          + "source"         = "terraform"
          + "workspace"      = "default"
        }
      + vm_protection_enabled = false
    }

Plan: 6 to add, 0 to change, 0 to destroy.


```

</details>

*Pusher: @thcp, Action: `pull_request`*